---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralSectionHasIncompleteDefinition
source: html/49aedac3-46ad-3674-fa80-f91447e51f0f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralSectionHasIncompleteDefinition Property

Structural Section has incomplete definition

## Syntax (C#)
```csharp
public static FailureDefinitionId StructuralSectionHasIncompleteDefinition { get; }
```